[Killed] ObjectLiteral
src/state/strategy/stepMachine.ts:53:12
   },
   context: INITIAL_CONTEXT,
   on: {
-    RESET: {
-      target: ".idle",
-      actions: assign(() => ({ ...INITIAL_CONTEXT })),
-    },
+    RESET: {},
   },
   states: {
killedBy: stepMachine — RESET transitions RESET from any state returns to idle with cleared context
statusReason: expected 'valid' to be 'idle' // Object.is equality

[Killed] ObjectLiteral
src/state/strategy/stepMachine.ts:61:19
   states: {
     idle: {
       on: {
-        VALIDATE: { target: "validating" },
+        VALIDATE: {},
       },
     },
killedBy: lifecycleSlice — dispatchStepEvent transitions a step through VALIDATE → VALIDATION_SUCCESS
statusReason: expected 'idle' to be 'validating' // Object.is equality

[Killed] ObjectLiteral
src/state/strategy/stepMachine.ts:65:11
       },
     },
     validating: {
-      on: {
-        VALIDATION_SUCCESS: {
-          target: "valid",
-          actions: assign({
-            validationErrors: () => null,
-            lastError: () => null,
-            estimatedSize: ({ context, event }) =>
-              event.estimatedSize !== undefined
-                ? event.estimatedSize
-                : context.estimatedSize,
-          }),
-        },
-        VALIDATION_ERROR: {
-          target: "invalid",
-          actions: assign({
-            validationErrors: ({ event }) => event.errors,
-          }),
-        },
-        RUN_ERROR: {
-          target: "failed",
-          actions: assign({
-            lastError: ({ event }) => event.message,
-          }),
-        },
-      },
+      on: {},
     },
     valid: {
killedBy: stepMachine — VALIDATION_SUCCESS transitions validating → valid on VALIDATION_SUCCESS without estimatedSize
statusReason: expected 'validating' to be 'valid' // Object.is equality

[Killed] StringLiteral
src/state/strategy/stepMachine.ts:67:19
     validating: {
       on: {
         VALIDATION_SUCCESS: {
-          target: "valid",
+          target: "",
           actions: assign({
             validationErrors: () => null,
killedBy: lifecycleSlice — dispatchStepEvent transitions a step through VALIDATE → VALIDATION_SUCCESS
statusReason: expected 'validating' to be 'valid' // Object.is equality

[Killed] ObjectLiteral
src/state/strategy/stepMachine.ts:91:12
         },
       },
     },
-    valid: {
-      on: {
-        VALIDATE: { target: "validating" },
-        RUN_COUNTS: { target: "running" },
-      },
-    },
+    valid: {},
     invalid: {
       on: {
killedBy: stepMachine — VALIDATE transitions valid → validating on VALIDATE
statusReason: expected 'valid' to be 'validating' // Object.is equality

[Killed] ObjectLiteral
src/state/strategy/stepMachine.ts:94:21
     valid: {
       on: {
         VALIDATE: { target: "validating" },
-        RUN_COUNTS: { target: "running" },
+        RUN_COUNTS: {},
       },
     },
killedBy: stepMachine — RUN_COUNTS / COUNTS_READY transitions valid → running on RUN_COUNTS
statusReason: expected 'valid' to be 'running' // Object.is equality

[Killed] ObjectLiteral
src/state/strategy/stepMachine.ts:97:14
         RUN_COUNTS: { target: "running" },
       },
     },
-    invalid: {
-      on: {
-        VALIDATE: { target: "validating" },
-      },
-    },
+    invalid: {},
     running: {
       on: {
killedBy: stepMachine — VALIDATE transitions invalid → validating on VALIDATE
statusReason: expected 'invalid' to be 'validating' // Object.is equality

[Killed] ObjectLiteral
src/state/strategy/stepMachine.ts:104:23
     },
     running: {
       on: {
-        COUNTS_READY: {
-          target: "complete",
-          actions: assign({
-            estimatedSize: ({ event }) => event.count,
-            lastError: () => null,
-          }),
-        },
+        COUNTS_READY: {},
         RUN_ERROR: {
           target: "failed",
killedBy: stepMachine — RUN_COUNTS / COUNTS_READY transitions running → complete on COUNTS_READY, stores count
statusReason: expected 'running' to be 'complete' // Object.is equality

[Killed] StringLiteral
src/state/strategy/stepMachine.ts:105:19
     running: {
       on: {
         COUNTS_READY: {
-          target: "complete",
+          target: "",
           actions: assign({
             estimatedSize: ({ event }) => event.count,
killedBy: stepMachine — RUN_COUNTS / COUNTS_READY transitions running → complete on COUNTS_READY, stores count
statusReason: expected 'running' to be 'complete' // Object.is equality

[Killed] ObjectLiteral
src/state/strategy/stepMachine.ts:106:27
       on: {
         COUNTS_READY: {
           target: "complete",
-          actions: assign({
-            estimatedSize: ({ event }) => event.count,
-            lastError: () => null,
-          }),
+          actions: assign({}),
         },
         RUN_ERROR: {
killedBy: stepMachine — RUN_COUNTS / COUNTS_READY transitions running → complete on COUNTS_READY, stores count
statusReason: expected 5 to be 123 // Object.is equality

[Killed] ObjectLiteral
src/state/strategy/stepMachine.ts:120:11
       },
     },
     complete: {
-      on: {
-        VALIDATE: { target: "validating" },
-        RUN_COUNTS: { target: "running" },
-      },
+      on: {},
     },
     failed: {
killedBy: stepMachine — VALIDATE transitions complete → validating on VALIDATE
statusReason: expected 'complete' to be 'validating' // Object.is equality

[Killed] ObjectLiteral
src/state/strategy/stepMachine.ts:125:13
         RUN_COUNTS: { target: "running" },
       },
     },
-    failed: {
-      on: {
-        VALIDATE: { target: "validating" },
-        RUN_COUNTS: { target: "running" },
-      },
-    },
+    failed: {},
   },
 });
killedBy: stepMachine — VALIDATE transitions failed → validating on VALIDATE
statusReason: expected 'failed' to be 'validating' // Object.is equality

[Killed] StringLiteral
src/state/strategy/stepMachine.ts:127:29
     },
     failed: {
       on: {
-        VALIDATE: { target: "validating" },
+        VALIDATE: { target: "" },
         RUN_COUNTS: { target: "running" },
       },
killedBy: stepMachine — VALIDATE transitions failed → validating on VALIDATE
statusReason: expected 'failed' to be 'validating' // Object.is equality

[Killed] BlockStatement
src/state/strategy/stepMachine.ts:158:34
 }
 
 export function initialStepSnapshot(seed?: StepLifecycleSeed): StepMachineSnapshot {
-  if (seed?.state !== undefined) {
-    return seedStepMachine(seed.state, seed.context);
-  }
+  if (seed?.state !== undefined) {}
   const base = emptyInitialSnapshot();
   if (seed?.context) {
killedBy: stepMachine — initialStepSnapshot honours a seeded state together with its context
statusReason: expected 'idle' to be 'failed' // Object.is equality

[Killed] BlockStatement
src/state/strategy/stepMachine.ts:162:22
     return seedStepMachine(seed.state, seed.context);
   }
   const base = emptyInitialSnapshot();
-  if (seed?.context) {
-    return { ...base, context: { ...base.context, ...seed.context } };
-  }
+  if (seed?.context) {}
   return base;
 }
killedBy: stepMachine — initialStepSnapshot merges a context-only seed onto the idle state, defaulting the untouched fields
statusReason: expected null to be 7 // Object.is equality
