[Killed] BlockStatement
src/state/strategy/draftSlice.ts:13:40
 > = (set) => ({
   lastFailedOperation: null,
 
-  setLastFailedOperation: (payload) => {
-    set({ lastFailedOperation: payload });
-  },
+  setLastFailedOperation: (payload) => {},
 
   clear: () => {
killedBy: draftSlice — setLastFailedOperation stores the failed operation so the retry affordance can replay it
statusReason: expected null to deeply equal { op: { kind: 'deleteStep', …(2) } }

[Killed] BlockStatement
src/state/strategy/draftSlice.ts:17:16
     set({ lastFailedOperation: payload });
   },
 
-  clear: () => {
-    set({
-      lastFailedOperation: null,
-      stepLifecycleById: {},
-      undoStack: [],
-      redoStack: [],
-    });
-  },
+  clear: () => {},
 });
 
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) pushSnapshot is a no-op when prev.strategy is null
statusReason: expected [ [ { op: 'replace', …(2) } ] ] to have a length of +0 but got 1
