[Killed] ConditionalExpression
src/state/strategy/historySlice.ts:13:10
 const MAX_HISTORY = 50;
 
 function trimStack(stack: Patch[][]): Patch[][] {
-  while (stack.length > MAX_HISTORY) {
+  while (false) {
     stack.shift();
   }
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) caps undoStack at MAX_HISTORY (50)
statusReason: expected 60 to be 50 // Object.is equality

[Killed] EqualityOperator
src/state/strategy/historySlice.ts:13:10
 const MAX_HISTORY = 50;
 
 function trimStack(stack: Patch[][]): Patch[][] {
-  while (stack.length > MAX_HISTORY) {
+  while (stack.length >= MAX_HISTORY) {
     stack.shift();
   }
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) caps undoStack at MAX_HISTORY (50)
statusReason: expected 49 to be 50 // Object.is equality

[Killed] BlockStatement
src/state/strategy/historySlice.ts:20:61
 }
 
 function inversePatchesBetween(prev: HistorySnapshot, next: HistorySnapshot): Patch[] {
-  const [, , inverse] = produceWithPatches(prev, (draft) => {
-    draft.strategy = next.strategy;
-  });
+  const [, , inverse] = produceWithPatches(prev, (draft) => {});
   return inverse;
 }
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) pushSnapshot stores inverse patches required to undo back to prev
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/state/strategy/historySlice.ts:35:36
   undoStack: [],
   redoStack: [],
 
-  pushSnapshot: (prev, current) => {
-    if (prev.strategy === null) return;
-    const inverse = inversePatchesBetween(prev, { strategy: current });
-    if (inverse.length === 0) return;
-    set((state) => ({
-      undoStack: trimStack([...state.undoStack, inverse]),
-      redoStack: [],
-    }));
-  },
+  pushSnapshot: (prev, current) => {},
 
   undo: (current) => {
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) pushSnapshot stores inverse patches required to undo back to prev
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/state/strategy/historySlice.ts:36:9
   redoStack: [],
 
   pushSnapshot: (prev, current) => {
-    if (prev.strategy === null) return;
+    if (false) return;
     const inverse = inversePatchesBetween(prev, { strategy: current });
     if (inverse.length === 0) return;
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) pushSnapshot is a no-op when prev.strategy is null
statusReason: expected [ [ { op: 'replace', …(2) } ] ] to have a length of +0 but got 1

[Killed] EqualityOperator
src/state/strategy/historySlice.ts:36:9
   redoStack: [],
 
   pushSnapshot: (prev, current) => {
-    if (prev.strategy === null) return;
+    if (prev.strategy !== null) return;
     const inverse = inversePatchesBetween(prev, { strategy: current });
     if (inverse.length === 0) return;
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) pushSnapshot stores inverse patches required to undo back to prev
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/state/strategy/historySlice.ts:38:9
   pushSnapshot: (prev, current) => {
     if (prev.strategy === null) return;
     const inverse = inversePatchesBetween(prev, { strategy: current });
-    if (inverse.length === 0) return;
+    if (inverse.length !== 0) return;
     set((state) => ({
       undoStack: trimStack([...state.undoStack, inverse]),
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) pushSnapshot stores inverse patches required to undo back to prev
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/state/strategy/historySlice.ts:38:9
   pushSnapshot: (prev, current) => {
     if (prev.strategy === null) return;
     const inverse = inversePatchesBetween(prev, { strategy: current });
-    if (inverse.length === 0) return;
+    if (true) return;
     set((state) => ({
       undoStack: trimStack([...state.undoStack, inverse]),
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) pushSnapshot stores inverse patches required to undo back to prev
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
src/state/strategy/historySlice.ts:39:21
     if (prev.strategy === null) return;
     const inverse = inversePatchesBetween(prev, { strategy: current });
     if (inverse.length === 0) return;
-    set((state) => ({
-      undoStack: trimStack([...state.undoStack, inverse]),
-      redoStack: [],
-    }));
+    set((state) => ({}));
   },
 
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) pushSnapshot stores inverse patches required to undo back to prev
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/state/strategy/historySlice.ts:47:35
 
   undo: (current) => {
     const { undoStack, redoStack } = get();
-    const lastInverse = undoStack[undoStack.length - 1];
+    const lastInverse = undoStack[undoStack.length + 1];
     if (!lastInverse) return null;
 
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) undo applies the inverse to the supplied current and returns the prior strategy
statusReason: expected undefined to be 'Search 1' // Object.is equality

[Killed] BlockStatement
src/state/strategy/historySlice.ts:52:18
 
     const [restored, , forward] = produceWithPatches(
       { strategy: current } satisfies HistorySnapshot,
-      (draft) => {
-        applyPatches(draft, lastInverse);
-      },
+      (draft) => {},
     );
 
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) undo applies the inverse to the supplied current and returns the prior strategy
statusReason: expected 'Renamed' to be 'Search 1' // Object.is equality

[Killed] MethodExpression
src/state/strategy/historySlice.ts:58:18
     );
 
     set({
-      undoStack: undoStack.slice(0, -1),
+      undoStack: undoStack,
       redoStack: [...redoStack, forward],
     });
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) undo applies the inverse to the supplied current and returns the prior strategy
statusReason: expected [ [ { op: 'replace', …(2) } ] ] to have a length of +0 but got 1

[Killed] UnaryOperator
src/state/strategy/historySlice.ts:58:37
     );
 
     set({
-      undoStack: undoStack.slice(0, -1),
+      undoStack: undoStack.slice(0, +1),
       redoStack: [...redoStack, forward],
     });
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) undo applies the inverse to the supplied current and returns the prior strategy
statusReason: expected [ [ { op: 'replace', …(2) } ] ] to have a length of +0 but got 1

[Killed] ArrayDeclaration
src/state/strategy/historySlice.ts:59:18
 
     set({
       undoStack: undoStack.slice(0, -1),
-      redoStack: [...redoStack, forward],
+      redoStack: [],
     });
     return restored.strategy;
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) undo applies the inverse to the supplied current and returns the prior strategy
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/state/strategy/historySlice.ts:66:35
 
   redo: (current) => {
     const { undoStack, redoStack } = get();
-    const lastForward = redoStack[redoStack.length - 1];
+    const lastForward = redoStack[redoStack.length + 1];
     if (!lastForward) return null;
 
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) redo applies the forward patch and returns the new strategy
statusReason: expected undefined to be 'Renamed' // Object.is equality

[Killed] BlockStatement
src/state/strategy/historySlice.ts:71:18
 
     const [restored, , inverse] = produceWithPatches(
       { strategy: current } satisfies HistorySnapshot,
-      (draft) => {
-        applyPatches(draft, lastForward);
-      },
+      (draft) => {},
     );
 
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) redo applies the forward patch and returns the new strategy
statusReason: expected 'Search 1' to be 'Renamed' // Object.is equality

[Killed] ArrayDeclaration
src/state/strategy/historySlice.ts:77:18
     );
 
     set({
-      undoStack: [...undoStack, inverse],
+      undoStack: [],
       redoStack: redoStack.slice(0, -1),
     });
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) redo applies the forward patch and returns the new strategy
statusReason: expected [] to have a length of 1 but got +0

[Killed] UnaryOperator
src/state/strategy/historySlice.ts:78:37
 
     set({
       undoStack: [...undoStack, inverse],
-      redoStack: redoStack.slice(0, -1),
+      redoStack: redoStack.slice(0, +1),
     });
     return restored.strategy;
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) redo applies the forward patch and returns the new strategy
statusReason: expected [ [ { op: 'replace', …(2) } ] ] to have a length of +0 but got 1

[Killed] MethodExpression
src/state/strategy/historySlice.ts:78:18
 
     set({
       undoStack: [...undoStack, inverse],
-      redoStack: redoStack.slice(0, -1),
+      redoStack: redoStack,
     });
     return restored.strategy;
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) redo applies the forward patch and returns the new strategy
statusReason: expected [ [ { op: 'replace', …(2) } ] ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/state/strategy/historySlice.ts:83:18
     return restored.strategy;
   },
 
-  canUndo: () => get().undoStack.length > 0,
+  canUndo: () => true,
   canRedo: () => get().redoStack.length > 0,
 
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) canUndo is false on an empty stack, true once a snapshot is pushed, false again after undoing it
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/state/strategy/historySlice.ts:83:18
     return restored.strategy;
   },
 
-  canUndo: () => get().undoStack.length > 0,
+  canUndo: () => false,
   canRedo: () => get().redoStack.length > 0,
 
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) canUndo is false on an empty stack, true once a snapshot is pushed, false again after undoing it
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/state/strategy/historySlice.ts:84:18
   },
 
   canUndo: () => get().undoStack.length > 0,
-  canRedo: () => get().redoStack.length > 0,
+  canRedo: () => false,
 
   clearHistory: () => set({ undoStack: [], redoStack: [] }),
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) canRedo is false until something has been undone, and false again once redone
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/state/strategy/historySlice.ts:84:18
   },
 
   canUndo: () => get().undoStack.length > 0,
-  canRedo: () => get().redoStack.length > 0,
+  canRedo: () => get().redoStack.length <= 0,
 
   clearHistory: () => set({ undoStack: [], redoStack: [] }),
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) canRedo is false until something has been undone, and false again once redone
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/state/strategy/historySlice.ts:86:17
   canUndo: () => get().undoStack.length > 0,
   canRedo: () => get().redoStack.length > 0,
 
-  clearHistory: () => set({ undoStack: [], redoStack: [] }),
+  clearHistory: () => undefined,
 });
 
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) clearHistory empties both stacks but leaves step lifecycles alone
statusReason: expected [ [ { op: 'replace', …(2) } ] ] to deeply equal []
