[Killed] BlockStatement
src/state/strategy/lifecycleSlice.ts:28:40
 > = (set, get) => ({
   stepLifecycleById: {},
 
-  initStepLifecycle: (stepId, seed) => {
-    set((state) => {
-      if (state.stepLifecycleById[stepId]) return state;
-      return {
-        stepLifecycleById: {
-          ...state.stepLifecycleById,
-          [stepId]: initialStepSnapshot(seed),
-        },
-      };
-    });
-  },
+  initStepLifecycle: (stepId, seed) => {},
 
   dispatchStepEvent: (stepId, event) => {
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) clearHistory empties both stacks but leaves step lifecycles alone
statusReason: expected undefined to be 'valid' // Object.is equality

[Killed] ConditionalExpression
src/state/strategy/lifecycleSlice.ts:30:11
 
   initStepLifecycle: (stepId, seed) => {
     set((state) => {
-      if (state.stepLifecycleById[stepId]) return state;
+      if (false) return state;
       return {
         stepLifecycleById: {
killedBy: lifecycleSlice — initStepLifecycle does not clobber an existing lifecycle
statusReason: expected 'idle' to be 'complete' // Object.is equality

[Killed] ConditionalExpression
src/state/strategy/lifecycleSlice.ts:30:11
 
   initStepLifecycle: (stepId, seed) => {
     set((state) => {
-      if (state.stepLifecycleById[stepId]) return state;
+      if (true) return state;
       return {
         stepLifecycleById: {
killedBy: state/strategy/historySlice (TQ-cache aware: pure patch logic) clearHistory empties both stacks but leaves step lifecycles alone
statusReason: expected undefined to be 'valid' // Object.is equality

[Killed] BlockStatement
src/state/strategy/lifecycleSlice.ts:40:41
     });
   },
 
-  dispatchStepEvent: (stepId, event) => {
-    set((state) => {
-      const current = ensureSnapshot(state.stepLifecycleById, stepId);
-      const next = transitionStep(current, event);
-      if (next === current) return state;
-      return {
-        stepLifecycleById: { ...state.stepLifecycleById, [stepId]: next },
-      };
-    });
-  },
+  dispatchStepEvent: (stepId, event) => {},
 
   removeStepLifecycle: (stepId) => {
killedBy: lifecycleSlice — dispatchStepEvent transitions a step through VALIDATE → VALIDATION_SUCCESS
statusReason: expected 'idle' to be 'validating' // Object.is equality

[Killed] EqualityOperator
src/state/strategy/lifecycleSlice.ts:44:11
     set((state) => {
       const current = ensureSnapshot(state.stepLifecycleById, stepId);
       const next = transitionStep(current, event);
-      if (next === current) return state;
+      if (next !== current) return state;
       return {
         stepLifecycleById: { ...state.stepLifecycleById, [stepId]: next },
killedBy: lifecycleSlice — dispatchStepEvent transitions a step through VALIDATE → VALIDATION_SUCCESS
statusReason: expected 'idle' to be 'validating' // Object.is equality

[Killed] ConditionalExpression
src/state/strategy/lifecycleSlice.ts:44:11
     set((state) => {
       const current = ensureSnapshot(state.stepLifecycleById, stepId);
       const next = transitionStep(current, event);
-      if (next === current) return state;
+      if (true) return state;
       return {
         stepLifecycleById: { ...state.stepLifecycleById, [stepId]: next },
killedBy: lifecycleSlice — dispatchStepEvent transitions a step through VALIDATE → VALIDATION_SUCCESS
statusReason: expected 'idle' to be 'validating' // Object.is equality

[Killed] ObjectLiteral
src/state/strategy/lifecycleSlice.ts:46:28
       const next = transitionStep(current, event);
       if (next === current) return state;
       return {
-        stepLifecycleById: { ...state.stepLifecycleById, [stepId]: next },
+        stepLifecycleById: {},
       };
     });
killedBy: lifecycleSlice — dispatchStepEvent transitions a step through VALIDATE → VALIDATION_SUCCESS
statusReason: Cannot read properties of null (reading 'value')

[Killed] BlockStatement
src/state/strategy/lifecycleSlice.ts:51:36
     });
   },
 
-  removeStepLifecycle: (stepId) => {
-    set((state) => {
-      if (!state.stepLifecycleById[stepId]) return state;
-      const next = { ...state.stepLifecycleById };
-      delete next[stepId];
-      return { stepLifecycleById: next };
-    });
-  },
+  removeStepLifecycle: (stepId) => {},
 
   getStepLifecycle: (stepId) => {
killedBy: lifecycleSlice — removeStepLifecycle removes the lifecycle entry for a step id
statusReason: expected { status: 'active', …(14) } to be null

[Killed] ConditionalExpression
src/state/strategy/lifecycleSlice.ts:53:11
 
   removeStepLifecycle: (stepId) => {
     set((state) => {
-      if (!state.stepLifecycleById[stepId]) return state;
+      if (false) return state;
       const next = { ...state.stepLifecycleById };
       delete next[stepId];
killedBy: lifecycleSlice — no-op updates never churn state identity removing a step id with no lifecycle leaves stepLifecycleById identical
statusReason: expected { s1: { status: 'active', …(14) } } to be { s1: { status: 'active', …(14) } } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { s1: { status: 'active', …(14) } }
Received: serializes to the same string

[Killed] BooleanLiteral
src/state/strategy/lifecycleSlice.ts:53:11
 
   removeStepLifecycle: (stepId) => {
     set((state) => {
-      if (!state.stepLifecycleById[stepId]) return state;
+      if (state.stepLifecycleById[stepId]) return state;
       const next = { ...state.stepLifecycleById };
       delete next[stepId];
killedBy: lifecycleSlice — removeStepLifecycle removes the lifecycle entry for a step id
statusReason: expected { status: 'active', …(14) } to be null

[Killed] BlockStatement
src/state/strategy/lifecycleSlice.ts:64:42
     return get().stepLifecycleById[stepId] ?? null;
   },
 
-  applyStepValidationErrors: (errors) => {
-    set((state) => {
-      let changed = false;
-      const next = { ...state.stepLifecycleById };
-      for (const [stepId, message] of Object.entries(errors)) {
-        const snapshot = next[stepId] ?? initialStepSnapshot();
-        const event: StepMachineEvent =
-          message != null
-            ? {
-                type: "VALIDATION_ERROR",
-                errors: { general: [message], byKey: {} },
-              }
-            : { type: "VALIDATION_SUCCESS" };
-        const validating = transitionStep(snapshot, { type: "VALIDATE" });
-        const resolved = transitionStep(validating, event);
-        if (resolved !== snapshot) {
-          next[stepId] = resolved;
-          changed = true;
-        }
-      }
-      if (!changed) return state;
-      return { stepLifecycleById: next };
-    });
-  },
+  applyStepValidationErrors: (errors) => {},
 
   applyStepCounts: (counts) => {
killedBy: lifecycleSlice — batch helpers applyStepValidationErrors dispatches VALIDATION_ERROR/VALIDATION_SUCCESS per step
statusReason: expected 'validating' to be 'invalid' // Object.is equality

[Killed] BooleanLiteral
src/state/strategy/lifecycleSlice.ts:66:21
 
   applyStepValidationErrors: (errors) => {
     set((state) => {
-      let changed = false;
+      let changed = true;
       const next = { ...state.stepLifecycleById };
       for (const [stepId, message] of Object.entries(errors)) {
killedBy: lifecycleSlice — no-op updates never churn state identity applyStepValidationErrors with an empty batch leaves stepLifecycleById identical
statusReason: expected { s1: { status: 'active', …(14) } } to be { s1: { status: 'active', …(14) } } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { s1: { status: 'active', …(14) } }
Received: serializes to the same string

[Killed] BlockStatement
src/state/strategy/lifecycleSlice.ts:68:63
     set((state) => {
       let changed = false;
       const next = { ...state.stepLifecycleById };
-      for (const [stepId, message] of Object.entries(errors)) {
-        const snapshot = next[stepId] ?? initialStepSnapshot();
-        const event: StepMachineEvent =
-          message != null
-            ? {
-                type: "VALIDATION_ERROR",
-                errors: { general: [message], byKey: {} },
-              }
-            : { type: "VALIDATION_SUCCESS" };
-        const validating = transitionStep(snapshot, { type: "VALIDATE" });
-        const resolved = transitionStep(validating, event);
-        if (resolved !== snapshot) {
-          next[stepId] = resolved;
-          changed = true;
-        }
-      }
+      for (const [stepId, message] of Object.entries(errors)) {}
       if (!changed) return state;
       return { stepLifecycleById: next };
killedBy: lifecycleSlice — batch helpers applyStepValidationErrors dispatches VALIDATION_ERROR/VALIDATION_SUCCESS per step
statusReason: expected 'validating' to be 'invalid' // Object.is equality

[Killed] ConditionalExpression
src/state/strategy/lifecycleSlice.ts:79:13
             : { type: "VALIDATION_SUCCESS" };
         const validating = transitionStep(snapshot, { type: "VALIDATE" });
         const resolved = transitionStep(validating, event);
-        if (resolved !== snapshot) {
+        if (false) {
           next[stepId] = resolved;
           changed = true;
killedBy: lifecycleSlice — batch helpers applyStepValidationErrors dispatches VALIDATION_ERROR/VALIDATION_SUCCESS per step
statusReason: expected 'validating' to be 'invalid' // Object.is equality

[Killed] BlockStatement
src/state/strategy/lifecycleSlice.ts:79:36
             : { type: "VALIDATION_SUCCESS" };
         const validating = transitionStep(snapshot, { type: "VALIDATE" });
         const resolved = transitionStep(validating, event);
-        if (resolved !== snapshot) {
-          next[stepId] = resolved;
-          changed = true;
-        }
+        if (resolved !== snapshot) {}
       }
       if (!changed) return state;
killedBy: lifecycleSlice — batch helpers applyStepValidationErrors dispatches VALIDATION_ERROR/VALIDATION_SUCCESS per step
statusReason: expected 'validating' to be 'invalid' // Object.is equality

[Killed] BooleanLiteral
src/state/strategy/lifecycleSlice.ts:81:21
         const resolved = transitionStep(validating, event);
         if (resolved !== snapshot) {
           next[stepId] = resolved;
-          changed = true;
+          changed = false;
         }
       }
killedBy: lifecycleSlice — batch helpers applyStepValidationErrors dispatches VALIDATION_ERROR/VALIDATION_SUCCESS per step
statusReason: expected 'validating' to be 'invalid' // Object.is equality

[Killed] ConditionalExpression
src/state/strategy/lifecycleSlice.ts:84:11
           changed = true;
         }
       }
-      if (!changed) return state;
+      if (false) return state;
       return { stepLifecycleById: next };
     });
killedBy: lifecycleSlice — no-op updates never churn state identity applyStepValidationErrors with an empty batch leaves stepLifecycleById identical
statusReason: expected { s1: { status: 'active', …(14) } } to be { s1: { status: 'active', …(14) } } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { s1: { status: 'active', …(14) } }
Received: serializes to the same string

[Killed] BooleanLiteral
src/state/strategy/lifecycleSlice.ts:84:11
           changed = true;
         }
       }
-      if (!changed) return state;
+      if (changed) return state;
       return { stepLifecycleById: next };
     });
killedBy: lifecycleSlice — batch helpers applyStepValidationErrors dispatches VALIDATION_ERROR/VALIDATION_SUCCESS per step
statusReason: expected 'validating' to be 'invalid' // Object.is equality

[Killed] BlockStatement
src/state/strategy/lifecycleSlice.ts:89:32
     });
   },
 
-  applyStepCounts: (counts) => {
-    set((state) => {
-      let changed = false;
-      const next = { ...state.stepLifecycleById };
-      for (const [stepId, count] of Object.entries(counts)) {
-        const resolvedCount: number | null =
-          typeof count === "number" ? count : null;
-        const snapshot = next[stepId] ?? initialStepSnapshot({ state: "valid" });
-        const running = transitionStep(snapshot, { type: "RUN_COUNTS" });
-        const done = transitionStep(running, {
-          type: "COUNTS_READY",
-          count: resolvedCount,
-        });
-        if (done !== snapshot) {
-          next[stepId] = done;
-          changed = true;
-        }
-      }
-      if (!changed) return state;
-      return { stepLifecycleById: next };
-    });
-  },
+  applyStepCounts: (counts) => {},
 });
 
killedBy: lifecycleSlice — batch helpers applyStepCounts dispatches RUN_COUNTS + COUNTS_READY per step
statusReason: expected 'valid' to be 'complete' // Object.is equality

[Killed] BlockStatement
src/state/strategy/lifecycleSlice.ts:93:61
     set((state) => {
       let changed = false;
       const next = { ...state.stepLifecycleById };
-      for (const [stepId, count] of Object.entries(counts)) {
-        const resolvedCount: number | null =
-          typeof count === "number" ? count : null;
-        const snapshot = next[stepId] ?? initialStepSnapshot({ state: "valid" });
-        const running = transitionStep(snapshot, { type: "RUN_COUNTS" });
-        const done = transitionStep(running, {
-          type: "COUNTS_READY",
-          count: resolvedCount,
-        });
-        if (done !== snapshot) {
-          next[stepId] = done;
-          changed = true;
-        }
-      }
+      for (const [stepId, count] of Object.entries(counts)) {}
       if (!changed) return state;
       return { stepLifecycleById: next };
killedBy: lifecycleSlice — batch helpers applyStepCounts dispatches RUN_COUNTS + COUNTS_READY per step
statusReason: expected 'valid' to be 'complete' // Object.is equality

[Killed] ConditionalExpression
src/state/strategy/lifecycleSlice.ts:102:13
           type: "COUNTS_READY",
           count: resolvedCount,
         });
-        if (done !== snapshot) {
+        if (true) {
           next[stepId] = done;
           changed = true;
killedBy: lifecycleSlice — no-op updates never churn state identity counts arriving for a step that has been marked invalid are discarded
statusReason: expected { s1: { status: 'active', …(14) } } to be { s1: { status: 'active', …(14) } } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { s1: { status: 'active', …(14) } }
Received: serializes to the same string

[Killed] EqualityOperator
src/state/strategy/lifecycleSlice.ts:102:13
           type: "COUNTS_READY",
           count: resolvedCount,
         });
-        if (done !== snapshot) {
+        if (done === snapshot) {
           next[stepId] = done;
           changed = true;
killedBy: lifecycleSlice — batch helpers applyStepCounts dispatches RUN_COUNTS + COUNTS_READY per step
statusReason: expected 'valid' to be 'complete' // Object.is equality

[Killed] BooleanLiteral
src/state/strategy/lifecycleSlice.ts:104:21
         });
         if (done !== snapshot) {
           next[stepId] = done;
-          changed = true;
+          changed = false;
         }
       }
killedBy: lifecycleSlice — batch helpers applyStepCounts dispatches RUN_COUNTS + COUNTS_READY per step
statusReason: expected 'valid' to be 'complete' // Object.is equality

[Killed] ConditionalExpression
src/state/strategy/lifecycleSlice.ts:107:11
           changed = true;
         }
       }
-      if (!changed) return state;
+      if (true) return state;
       return { stepLifecycleById: next };
     });
killedBy: lifecycleSlice — batch helpers applyStepCounts dispatches RUN_COUNTS + COUNTS_READY per step
statusReason: expected 'valid' to be 'complete' // Object.is equality

[Killed] ObjectLiteral
src/state/strategy/lifecycleSlice.ts:108:14
         }
       }
       if (!changed) return state;
-      return { stepLifecycleById: next };
+      return {};
     });
   },
killedBy: lifecycleSlice — batch helpers applyStepCounts dispatches RUN_COUNTS + COUNTS_READY per step
statusReason: expected 'valid' to be 'complete' // Object.is equality
