[Killed] ArrowFunction
src/state/strategy/metaSlice.ts:18:29
 > = (set) => ({
   graphValidationStatus: {},
 
-  setGraphValidationStatus: (id, hasErrors) =>
-    set((state) => ({
-      graphValidationStatus: {
-        ...state.graphValidationStatus,
-        [id]: hasErrors,
-      },
-    })),
+  setGraphValidationStatus: () => undefined,
 });
 
killedBy: metaSlice — setGraphValidationStatus records the error flag under the given strategy id
statusReason: expected {} to deeply equal { 'strategy-1': true }
