[Killed] ConditionalExpression
src/state/strategy/selectors.ts:9:17
   strategy: Strategy | null | undefined,
 ): Record<string, Step> {
   const steps = strategy?.steps;
-  if (!steps || steps.length === 0) return EMPTY_STEPS_BY_ID;
+  if (!steps || false) return EMPTY_STEPS_BY_ID;
   return getCachedStepsById(steps);
 }
killedBy: useStepsById returns the shared empty map for a strategy with no steps
statusReason: expected {} to be {} // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: {}
Received: serializes to the same string

[Killed] EqualityOperator
src/state/strategy/selectors.ts:9:17
   strategy: Strategy | null | undefined,
 ): Record<string, Step> {
   const steps = strategy?.steps;
-  if (!steps || steps.length === 0) return EMPTY_STEPS_BY_ID;
+  if (!steps || steps.length !== 0) return EMPTY_STEPS_BY_ID;
   return getCachedStepsById(steps);
 }
killedBy: useStepsById indexes steps by id
statusReason: expected [] to deeply equal [ 'a', 'b' ]

[Killed] BlockStatement
src/state/strategy/selectors.ts:19:26
   const cached = STEPS_CACHE.get(steps);
   if (cached) return cached;
   const map: Record<string, Step> = {};
-  for (const s of steps) {
-    map[s.id] = s;
-  }
+  for (const s of steps) {}
   STEPS_CACHE.set(steps, map);
   return map;
killedBy: useStepsById indexes steps by id
statusReason: expected [] to deeply equal [ 'a', 'b' ]
