[Killed] ConditionalExpression
src/state/strategy/useStepSnapshot.ts:49:52
   snapshot: StepMachineSnapshot | undefined,
 ): StepLifecycleStateName {
   const value = snapshot?.value;
-  return STEP_LIFECYCLE_STATE_NAMES.find((name) => name === value) ?? "idle";
+  return STEP_LIFECYCLE_STATE_NAMES.find((name) => true) ?? "idle";
 }
 
killedBy: useStepSnapshot lifecycle estimatedSize overrides wire when present
statusReason: expected 'idle' to be 'complete' // Object.is equality

[Killed] EqualityOperator
src/state/strategy/useStepSnapshot.ts:49:52
   snapshot: StepMachineSnapshot | undefined,
 ): StepLifecycleStateName {
   const value = snapshot?.value;
-  return STEP_LIFECYCLE_STATE_NAMES.find((name) => name === value) ?? "idle";
+  return STEP_LIFECYCLE_STATE_NAMES.find((name) => name !== value) ?? "idle";
 }
 
killedBy: useStepSnapshot lifecycle estimatedSize overrides wire when present
statusReason: expected 'idle' to be 'complete' // Object.is equality

[Killed] EqualityOperator
src/state/strategy/useStepSnapshot.ts:56:19
   snapshot: StepMachineSnapshot | undefined,
   wire: Step | null,
 ): number | null {
-  if (snapshot && snapshot.context.estimatedSize !== null) {
+  if (snapshot && snapshot.context.estimatedSize === null) {
     return snapshot.context.estimatedSize;
   }
killedBy: useStepSnapshot lifecycle estimatedSize overrides wire when present
statusReason: expected 10 to be 500 // Object.is equality

[Killed] BlockStatement
src/state/strategy/useStepSnapshot.ts:56:60
   snapshot: StepMachineSnapshot | undefined,
   wire: Step | null,
 ): number | null {
-  if (snapshot && snapshot.context.estimatedSize !== null) {
-    return snapshot.context.estimatedSize;
-  }
+  if (snapshot && snapshot.context.estimatedSize !== null) {}
   const wireSize = wire?.estimatedSize;
   return typeof wireSize === "number" ? wireSize : null;
killedBy: useStepSnapshot lifecycle estimatedSize overrides wire when present
statusReason: expected 10 to be 500 // Object.is equality

[Killed] BlockStatement
src/state/strategy/useStepSnapshot.ts:69:43
   snapshot: StepMachineSnapshot | undefined,
   wire: Step | null,
 ): SearchValidationErrors | null {
-  if (snapshot?.context.validationErrors) {
-    return snapshot.context.validationErrors;
-  }
+  if (snapshot?.context.validationErrors) {}
   const wireErrors = wire?.validation?.errors;
   if (!wireErrors) return null;
killedBy: useStepSnapshot surfaces invalid state and validation errors
statusReason: expected undefined to be 'Missing taxon' // Object.is equality

[Killed] ConditionalExpression
src/state/strategy/useStepSnapshot.ts:96:17
         estimatedSize: resolveEstimatedSize(lifecycle, step),
         validationErrors: resolveValidationErrors(lifecycle, step),
         lastError: lifecycle?.context.lastError ?? null,
-        isBusy: lifecycleState === "validating" || lifecycleState === "running",
+        isBusy: false,
         isInvalid: lifecycleState === "invalid",
         isFailed: lifecycleState === "failed",
killedBy: useStepSnapshot isBusy true during validating / running
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/state/strategy/useStepSnapshot.ts:96:17
         estimatedSize: resolveEstimatedSize(lifecycle, step),
         validationErrors: resolveValidationErrors(lifecycle, step),
         lastError: lifecycle?.context.lastError ?? null,
-        isBusy: lifecycleState === "validating" || lifecycleState === "running",
+        isBusy: false || lifecycleState === "running",
         isInvalid: lifecycleState === "invalid",
         isFailed: lifecycleState === "failed",
killedBy: useStepSnapshot isBusy true during validating / running
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/state/strategy/useStepSnapshot.ts:97:20
         validationErrors: resolveValidationErrors(lifecycle, step),
         lastError: lifecycle?.context.lastError ?? null,
         isBusy: lifecycleState === "validating" || lifecycleState === "running",
-        isInvalid: lifecycleState === "invalid",
+        isInvalid: lifecycleState !== "invalid",
         isFailed: lifecycleState === "failed",
         isDraft: step?.status === "draft",
killedBy: useStepSnapshot defaults to idle with null values for a null step
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/state/strategy/useStepSnapshot.ts:97:20
         validationErrors: resolveValidationErrors(lifecycle, step),
         lastError: lifecycle?.context.lastError ?? null,
         isBusy: lifecycleState === "validating" || lifecycleState === "running",
-        isInvalid: lifecycleState === "invalid",
+        isInvalid: false,
         isFailed: lifecycleState === "failed",
         isDraft: step?.status === "draft",
killedBy: useStepSnapshot surfaces invalid state and validation errors
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/state/strategy/useStepSnapshot.ts:98:19
         lastError: lifecycle?.context.lastError ?? null,
         isBusy: lifecycleState === "validating" || lifecycleState === "running",
         isInvalid: lifecycleState === "invalid",
-        isFailed: lifecycleState === "failed",
+        isFailed: false,
         isDraft: step?.status === "draft",
         wdkPushError: step?.wdkPushError ?? null,
killedBy: useStepSnapshot surfaces failed state with lastError
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/state/strategy/useStepSnapshot.ts:98:19
         lastError: lifecycle?.context.lastError ?? null,
         isBusy: lifecycleState === "validating" || lifecycleState === "running",
         isInvalid: lifecycleState === "invalid",
-        isFailed: lifecycleState === "failed",
+        isFailed: lifecycleState !== "failed",
         isDraft: step?.status === "draft",
         wdkPushError: step?.wdkPushError ?? null,
killedBy: useStepSnapshot defaults to idle with null values for a null step
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/state/strategy/useStepSnapshot.ts:99:18
         isBusy: lifecycleState === "validating" || lifecycleState === "running",
         isInvalid: lifecycleState === "invalid",
         isFailed: lifecycleState === "failed",
-        isDraft: step?.status === "draft",
+        isDraft: step?.status !== "draft",
         wdkPushError: step?.wdkPushError ?? null,
       };
killedBy: useStepSnapshot marks a draft step as a draft
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/state/strategy/useStepSnapshot.ts:99:18
         isBusy: lifecycleState === "validating" || lifecycleState === "running",
         isInvalid: lifecycleState === "invalid",
         isFailed: lifecycleState === "failed",
-        isDraft: step?.status === "draft",
+        isDraft: false,
         wdkPushError: step?.wdkPushError ?? null,
       };
killedBy: useStepSnapshot marks a draft step as a draft
statusReason: expected false to be true // Object.is equality
